// 1. Використовуючи цикл "while" виведіть в консоль цифри від 0 до 10;
// * Зробіть те саме за допомогою циклу "do while" i "for"
const numbers = [1,2,3,4,5,6,7,8,9,10];
let i = 0;

while (i < 11) {
   console.log(i)
   ++i 
};

const numbers2 = [1,2,3,4,5,6,7,8,9,10];

for (let i = 0; i < 11; ++i ) {
    console.log(i);
};


const numbers3 = [1,2,3,4,5,6,7,8,9,10];
let i = 0;

do{
    console.log(i);
    ++i;
} while (i < 11);


// 2. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   console.log(i);
//   ++i;
// }

undefined 
//так як while (i > 10) те саме що while ( false ) і умова не буде виконуватись а піде далі


// 3. Яке останнє значення буде виведено в консоль?
// let i = 0;
//
// do {
//   console.log(i);
//   ++i;
// } while (i < 10)

 10

// 4. Замініть цей приклад використовуючи "while"
//
// for (let i = 0; i < 10; i++) {
//   console.log('i', i);
// }
    let i = 0;
    
    while ( i < 10 ) {
          console.log('i', i);
          ++i
    }  

// 5. Яке перше значення буде виведено в консоль?
// let i = 0;
//
// while (i > 10) {
//   ++i;
//   console.log(i);
// }

undefined 
/* так як while (i > 10) те саме що while ( false ) і умова не правдива 
і віповідно не буде виконуватись а піде далі */


// 6. Яке перше значення буде виведено в консоль?
// let i = 1;
//
// do {
//   i++;
//   console.log(i);
// } while (i < 10)

2